# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-11-10 19:58:52 krylon>
#
#+TAGS: internals(i) ui(u) database(d) design(e)
#+TAGS: meditation(m) optimize(o) refactor(r) cleanup(c)
#+TAGS: tags(t) suggestions(s)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Headlines [27/32]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2025-11-10 Mo 19:58]
   | Headline                                        | Time      |           |         |         |       |      |
   |-------------------------------------------------+-----------+-----------+---------+---------+-------+------|
   | *Total time*                                    | *4d 4:30* |           |         |         |       |      |
   |-------------------------------------------------+-----------+-----------+---------+---------+-------+------|
   | *Headlines [27/32]*                             | *4d 4:30* |           |         |         |       |      |
   | \_  /Components [14/15]/                        |           | /3d 2:52/ |         |         |       |      |
   | \_    Common [1/1]                              |           |           |    0:08 |         |       |      |
   | \_      Down the rabbit hole for pathlib        |           |           |         |    0:08 |       |      |
   | \_    Model [1/1]                               |           |           |    0:38 |         |       |      |
   | \_      Testing                                 |           |           |         |    0:27 |       |      |
   | \_      Rating and Tagging [0/0]                |           |           |         |    0:10 |       |      |
   | \_    Classifier [0/0]                          |           |           |    1:09 |         |       |      |
   | \_    Database [3/3]                            |           |           |   10:53 |         |       |      |
   | \_      Rating and Tagging [2/2]                |           |           |         |    1:21 |       |      |
   | \_        Tagging [0/0]                         |           |           |         |         |  0:46 |      |
   | \_      Testing                                 |           |           |         |    0:50 |       |      |
   | \_    Engine [0/0]                              |           |           |   11:36 |         |       |      |
   | \_    Web UI [10/12]                            |           |           | 2d 0:35 |         |       |      |
   | \_      Pagination [1/1]                        |           |           |         |    1:00 |       |      |
   | \_      Rating                                  |           |           |         |    0:06 |       |      |
   | \_      Tagging [6/6]                           |           |           |         | 1d 8:51 |       |      |
   | \_        View Tags and their linked Items      |           |           |         |         |  8:46 |      |
   | \_        Creating and editing Tags [1/3]       |           |           |         |         |  3:52 |      |
   | \_        Displaying Tags                       |           |           |         |         |  2:04 |      |
   | \_        Adding and removing Tags [3/3]        |           |           |         |         |  4:58 |      |
   | \_        Recommendation [1/1]                  |           |           |         |         | 13:11 |      |
   | \_          Don't recommend Tags already linked |           |           |         |         |       | 0:26 |
   | \_    Main [0/0]                                |           |           |    1:53 |         |       |      |
   | \_  /Features [6/9]/                            |           | /21:43/   |         |         |       |      |
   | \_    Later, B_tches [0/0]                      |           |           |    4:30 |         |       |      |
   | \_    Sanitize [3/3]                            |           |           |    4:19 |         |       |      |
   | \_    Tagging [0/0]                             |           |           |    2:49 |         |       |      |
   | \_    Rating [1/1]                              |           |           |    5:00 |         |       |      |
   | \_      Tokenizer                               |           |           |         |    3:03 |       |      |
   | \_    Caching [1/1]                             |           |           |    5:05 |         |       |      |
   | \_      Expiration!                             |           |           |         |    0:44 |       |      |
   | \_  /Bugs [5/5]/                                |           | /3:29/    |         |         |       |      |
   | \_    Missing text in Advisor                   |           |           |    0:14 |         |       |      |
   | \_    The mysterious case of the missing link   |           |           |    1:19 |         |       |      |
   | \_    Missing pubDate                           |           |           |    1:11 |         |       |      |
   | \_    The case of the failing refresh           |           |           |    0:20 |         |       |      |
   | \_    Deadlock in Cache layer                   |           |           |    0:25 |         |       |      |
   | \_  /Journal [1/1]/                             |           | /0:26/    |         |         |       |      |
   | \_    Wrestling with poetry                     |           |           |    0:26 |         |       |      |
   #+END:
** Components [14/15]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Common [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
**** DONE Down the rabbit hole for pathlib
     CLOSED: [2025-10-11 Sa 16:21]
     :LOGBOOK:
     CLOCK: [2025-10-11 Sa 16:13]--[2025-10-11 Sa 16:21] =>  0:08
     :END:
*** Model [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-10-14 Di 15:29]--[2025-10-14 Di 15:30] =>  0:01
    :END:
**** Testing
     :LOGBOOK:
     CLOCK: [2025-10-16 Do 16:32]--[2025-10-16 Do 16:59] =>  0:27
     :END:
**** DONE Rating and Tagging [0/0]                                     :tags:
     CLOSED: [2025-10-29 Mi 17:42]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY: children
     :END:
     :LOGBOOK:
     CLOCK: [2025-10-14 Di 15:30]--[2025-10-14 Di 15:40] =>  0:10
     :END:
*** Classifier [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-10-16 Do 17:48]--[2025-10-16 Do 17:52] =>  0:04
    CLOCK: [2025-10-16 Do 15:27]--[2025-10-16 Do 16:32] =>  1:05
    :END:
*** Database [3/3]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-10-15 Mi 14:58]--[2025-10-15 Mi 15:15] =>  0:17
    CLOCK: [2025-10-11 Sa 18:23]--[2025-10-11 Sa 18:26] =>  0:03
    CLOCK: [2025-10-09 Do 15:53]--[2025-10-09 Do 16:25] =>  0:32
    CLOCK: [2025-10-08 Mi 16:05]--[2025-10-08 Mi 16:20] =>  0:15
    CLOCK: [2025-10-08 Mi 14:40]--[2025-10-08 Mi 15:30] =>  0:50
    CLOCK: [2025-10-04 Sa 14:12]--[2025-10-04 Sa 19:11] =>  4:59
    CLOCK: [2025-10-02 Do 17:52]--[2025-10-02 Do 19:38] =>  1:46
    :END:
    I'm going to use SQLite3, /again/. But I want to try SQLAlchemy this
    time. Let's see what that is like.
    (30 minutes later) No, SQLAlchemy is too complicated for my humble needs.
**** DONE Rating and Tagging [2/2]                                     :tags:
     CLOSED: [2025-10-26 So 17:04]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY: children
     :END:
     :LOGBOOK:
     CLOCK: [2025-10-14 Di 15:40]--[2025-10-14 Di 16:15] =>  0:35
     :END:
***** DONE Tagging [0/0]
      CLOSED: [2025-10-26 So 17:04]
      :PROPERTIES:
      :COOKIE_DATA: todo recursive
      :VISIBILITY: children
      :END:
      :LOGBOOK:
      CLOCK: [2025-10-20 Mo 09:26]--[2025-10-20 Mo 10:12] =>  0:46
      :END:
***** DONE Rating [0/0]
      CLOSED: [2025-10-20 Mo 09:26]
**** Testing
     :LOGBOOK:
     CLOCK: [2025-10-20 Mo 10:50]--[2025-10-20 Mo 11:20] =>  0:30
     CLOCK: [2025-10-20 Mo 10:13]--[2025-10-20 Mo 10:33] =>  0:20
     :END:
*** Engine [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-10-11 Sa 18:26]--[2025-10-11 Sa 18:49] =>  0:23
    CLOCK: [2025-10-11 Sa 18:10]--[2025-10-11 Sa 18:23] =>  0:13
    CLOCK: [2025-10-11 Sa 15:20]--[2025-10-11 Sa 16:06] =>  0:46
    CLOCK: [2025-10-10 Fr 14:18]--[2025-10-10 Fr 17:50] =>  3:32
    CLOCK: [2025-10-09 Do 16:26]--[2025-10-09 Do 23:08] =>  6:42
    :END:
    Engine is - for lack of a better name - the part that regularly checks
    which Feeds are due for a refresh, fetches those Feeds and processes the
    Items.
    For some really perverse reason, I would like to try Python's asyncio.
    ...
    Strike that, I think I'll go with Twisted. I have used it before, albeit a
    /looooong/ time ago, it works in a similar manner, and it probably uses
    asyncio under the hood these days anyway.
    (The Internet says Twisted does not use asyncio, but still.)
    So Twisted it is!
*** Web UI [10/12]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-10-16 Do 17:52]--[2025-10-16 Do 19:20] =>  1:28
    CLOCK: [2025-10-15 Mi 16:00]--[2025-10-15 Mi 18:57] =>  2:57
    CLOCK: [2025-10-15 Mi 15:15]--[2025-10-15 Mi 15:22] =>  0:07
    CLOCK: [2025-10-14 Di 15:15]--[2025-10-14 Di 15:28] =>  0:13
    CLOCK: [2025-10-13 Mo 17:47]--[2025-10-13 Mo 23:41] =>  5:54
    CLOCK: [2025-10-11 Sa 19:31]--[2025-10-11 Sa 23:30] =>  3:59
    :END:
**** TODO Manage feeds from WebUI
     Until now, I've been doing that via the sqlite shell.
**** TODO Mark boring items visually [0/0]
**** DONE Pagination [1/1]
     CLOSED: [2025-11-06 Do 15:50]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY:
     :END:
     :LOGBOOK:
     CLOCK: [2025-11-06 Do 15:01]--[2025-11-06 Do 15:50] =>  0:49
     CLOCK: [2025-11-06 Do 14:33]--[2025-11-06 Do 14:44] =>  0:11
     :END:
     In the backend, support is already there, is just need to include it in
     the frontend.
***** SUSPENDED Make page size configurable?
      CLOSED: [2025-11-10 Mo 16:19]
      It would be nice - and shouldn't be too hard to make the page size
      configurable from the front end, using LocalStorage.
**** DONE Rating
     CLOSED: [2025-10-18 Sa 15:43]
     :LOGBOOK:
     CLOCK: [2025-10-18 Sa 15:38]--[2025-10-18 Sa 15:43] =>  0:05
     CLOCK: [2025-10-16 Do 17:47]--[2025-10-16 Do 17:48] =>  0:01
     :END:
**** DONE Tagging [6/6]                                                :tags:
     CLOSED: [2025-11-06 Do 16:37]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY: children
     :END:
***** DONE View Tags and their linked Items
      CLOSED: [2025-11-03 Mo 16:22]
      :LOGBOOK:
      CLOCK: [2025-11-02 So 17:58]--[2025-11-02 So 18:13] =>  0:15
      CLOCK: [2025-11-01 Sa 15:43]--[2025-11-01 Sa 19:44] =>  4:01
      CLOCK: [2025-10-31 Fr 14:15]--[2025-10-31 Fr 18:30] =>  4:15
      CLOCK: [2025-10-30 Do 19:10]--[2025-10-30 Do 19:25] =>  0:15
      :END:
***** DONE Creating and editing Tags [1/3]
      CLOSED: [2025-11-06 Do 16:37]
      :LOGBOOK:
      CLOCK: [2025-11-03 Mo 16:22]--[2025-11-03 Mo 20:14] =>  3:52
      :END:
      - [X] Create
      - [ ] Modify
      - [ ] Delete
        Deleting Tags is a bit tricky, if the Tag has children. Do those just
        inherit the deleted Tag's parent? Or do I delete them as well?
***** DONE Displaying Tags
      CLOSED: [2025-10-26 So 15:05]
      :LOGBOOK:
      CLOCK: [2025-10-26 So 13:47]--[2025-10-26 So 15:03] =>  1:16
      CLOCK: [2025-10-20 Mo 12:20]--[2025-10-20 Mo 13:08] =>  0:48
      :END:
***** DONE Adding and removing Tags [3/3]
      CLOSED: [2025-10-30 Do 17:55]
      :LOGBOOK:
      CLOCK: [2025-10-30 Do 17:18]--[2025-10-30 Do 17:55] =>  0:37
      CLOCK: [2025-10-26 So 17:47]--[2025-10-26 So 17:51] =>  0:04
      CLOCK: [2025-10-25 Sa 13:45]--[2025-10-25 Sa 15:56] =>  2:11
      CLOCK: [2025-10-20 Mo 18:11]--[2025-10-20 Mo 19:20] =>  1:09
      CLOCK: [2025-10-20 Mo 16:55]--[2025-10-20 Mo 17:22] =>  0:27
      CLOCK: [2025-10-20 Mo 16:45]--[2025-10-20 Mo 16:47] =>  0:02
      CLOCK: [2025-10-20 Mo 13:08]--[2025-10-20 Mo 13:36] =>  0:28
      :END:
      - [X] Order and indent Tags in menu according to hierarchy
      - [X] Add Tags
      - [X] Remove tags
***** DONE Recommendation [1/1]
      CLOSED: [2025-10-29 Mi 17:42]
      :LOGBOOK:
      CLOCK: [2025-10-29 Mi 16:02]--[2025-10-29 Mi 17:41] =>  1:39
      CLOCK: [2025-10-28 Di 17:04]--[2025-10-28 Di 19:36] =>  2:32
      CLOCK: [2025-10-27 Mo 14:38]--[2025-10-27 Mo 19:56] =>  5:18
      CLOCK: [2025-10-26 So 18:36]--[2025-10-26 So 21:52] =>  3:16
      :END:
****** DONE Don't recommend Tags already linked
       CLOSED: [2025-11-10 Mo 16:10]
       :LOGBOOK:
       CLOCK: [2025-11-10 Mo 15:44]--[2025-11-10 Mo 16:10] =>  0:26
       :END:
*** Main [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-10-11 Sa 16:22]--[2025-10-11 Sa 18:10] =>  1:48
    CLOCK: [2025-10-11 Sa 16:07]--[2025-10-11 Sa 16:12] =>  0:05
    :END:
** Features [6/9]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** TODO Later, B_tches [0/0]
    :LOGBOOK:
    CLOCK: [2025-11-10 Mo 16:21]--[2025-11-10 Mo 17:26] =>  1:05
    CLOCK: [2025-11-08 Sa 16:11]--[2025-11-08 Sa 19:36] =>  3:25
    :END:
    I want to mark Items as "I want to read that, just not right now."
    This one should be easy.
*** TODO Clustering? [0/0]
    Sometimes several Items from different news sources cover the same
    event. It would be really cool if I could cluster these Items together,
    and even cooler if that could be done automatically. I don't think it's
    possible but worth a try.
*** TODO Searching [0/0]
    I want to be able to search the database by text, but also by time and
    tags, respecting the tag hierarchy.
*** Sanitize [3/3]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-10-18 Sa 14:12]--[2025-10-18 Sa 15:28] =>  1:16
    CLOCK: [2025-10-17 Fr 15:03]--[2025-10-17 Fr 18:06] =>  3:03
    :END:
    I would like to scrub Javascript from the Item bodies. And change any
    links to open in a new window or tab. Can BeautifulSoup help me with that?
    I could do this in the frontend to, but I would like to do that before the
    browser even sees the offending HTML code.
    ...
    [2025-10-17 Fr 15:11] I /think/ I have an idea how to do that with
    BeautifulSoup. I should probably do that when fetching RSS feeds, before
    adding the Items to the database.
    ...
    Then again, I should keep the original content around; as I refine and
    change how I sanitize the HTML I may want to have older Items still
    benefit from updated scrubbing. ??? But I should at least cache the
    processed content.
**** Storage?
     Should I store the sanitized content in the database?
**** DONE Make links open in _blank
     CLOSED: [2025-10-18 Sa 15:16]
**** DONE Resize images
     CLOSED: [2025-10-18 Sa 15:28]
     I'll keep doing that in the frontend, because I want to scale images
     while preserving their aspect ratio. When rendering the template, we
     don't know yet what the image's size will be.
**** DONE Remove Javascript and such
     CLOSED: [2025-10-18 Sa 15:17]
*** Tagging [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-10-18 Sa 15:46]--[2025-10-18 Sa 18:35] =>  2:49
    :END:
*** Rating [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-10-14 Di 16:16]--[2025-10-14 Di 18:13] =>  1:57
    :END:
**** DONE Tokenizer
     CLOSED: [2025-11-08 Sa 15:02]
     :LOGBOOK:
     CLOCK: [2025-11-04 Di 16:17]--[2025-11-04 Di 19:20] =>  3:03
     :END:
     I should create a custom tokenizer that does stemming.
***** [2025-11-04 Di 16:20]
      I think I will use the PorterStemmer from nltk for stemming and
      langdetect for figuring out what language a piece of text is. 
*** Full-text search [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
*** DONE Caching [1/1]
    CLOSED: [2025-11-08 Sa 15:03]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-11-07 Fr 15:58]--[2025-11-07 Fr 17:10] =>  1:12
    CLOCK: [2025-11-05 Mi 15:59]--[2025-11-05 Mi 16:33] =>  0:34
    CLOCK: [2025-11-05 Mi 14:11]--[2025-11-05 Mi 15:57] =>  1:46
    CLOCK: [2025-11-05 Mi 10:45]--[2025-11-05 Mi 11:34] =>  0:49
    :END:
    There is *a lot* of potential for optimization that I am leaving on the
    table right now. In particular, there a lots of things I could speed up by
    caching. Premature optimization and all that.
    But when the time comes, performance is probably going to be not super
    great, at which point we will re-visit this topic.
    So, I am going to need to cache stemmed Item bodies for use in the
    Bayesian classifier, and the classification data for rating and tagging.
    LMDB conveniently allows one to create several databases within a single
    Environment, which is what I intend to do.
    I just need to think a little about a sane and simple interface.
    Okay, with that (hopefully) done, I need to use the cache in these places:
    - [X] Processing Items with NLTK
    - [X] Rating Items
    - [X] Suggesting Tags for Items
**** DONE Expiration!
     CLOSED: [2025-11-07 Fr 15:57]
     :LOGBOOK:
     CLOCK: [2025-11-07 Fr 15:13]--[2025-11-07 Fr 15:57] =>  0:44
     :END:
     Tokenization is not as much of an issue, but caching ratings and advice
     without an expiration date is a questionable idea, because as I rate and
     tag more Items, that affects future classifications and advice.
** Bugs [5/5]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** DONE Missing text in Advisor
    CLOSED: [2025-11-10 Mo 17:41]
    :LOGBOOK:
    CLOCK: [2025-11-10 Mo 17:27]--[2025-11-10 Mo 17:41] =>  0:14
    :END:
    [2025-11-10 Mo 17:40] The culprit was not explicitly encoding a cache key
    to UTF-8, causing LMDB to throw an Exception.
*** DONE The mysterious case of the missing link
    CLOSED: [2025-10-24 Fr 20:46]
    :LOGBOOK:
    CLOCK: [2025-10-24 Fr 19:27]--[2025-10-24 Fr 20:46] =>  1:19
    :END:
    In The Register's feed, there is another oddity, the Items do have a field
    named "url", but it is just an empty string.
    [2025-10-24 Fr 19:51] I have come to the conclusion that easy_rss just
    doesn't handle Atom very well; when I look at the raw XML, there are
    links. So I am going to give [[https://github.com/kagisearch/fastfeedparser][FastFeedParser]] a try.
    ...
    [2025-10-24 Fr 20:45] There were a few hickups, but it appears to be
    working now.
*** DONE Missing pubDate
    CLOSED: [2025-10-24 Fr 14:50]
    :LOGBOOK:
    CLOCK: [2025-10-24 Fr 13:38]--[2025-10-24 Fr 14:49] =>  1:11
    :END:
    The Register's Atom feed apparently has no pubDate field. I assume there
    is a timestamp under a different name. Let's take a look.
*** DONE The case of the failing refresh
    CLOSED: [2025-10-20 Mo 09:23]
    :LOGBOOK:
    CLOCK: [2025-10-15 Mi 15:35]--[2025-10-15 Mi 15:55] =>  0:20
    :END:
*** DONE Deadlock in Cache layer
    CLOSED: [2025-11-08 Sa 14:43]
    :LOGBOOK:
    CLOCK: [2025-11-08 Sa 14:18]--[2025-11-08 Sa 14:43] =>  0:25
    :END:
** Journal [1/1]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** [2025-10-11 Sa 19:06]
    The engine appears to work rather fine (judging from a very brief and
    superficial test 🙄), so I think now it's on to the web UI
*** CANCELLED Wrestling with poetry
    CLOSED: [2025-10-08 Mi 16:01]
    :LOGBOOK:
    CLOCK: [2025-10-08 Mi 15:35]--[2025-10-08 Mi 16:01] =>  0:26
    :END:
    I attempted to use poetry, but I find it is too complicated for my taste,
    and the payoff is too small for my needs to warrant its further use. 

